{"fullName":"Brute_Secondary_Bio_Armor","archetypeOrder":"secondary","description":"Your body is shielded by an incredibly durable Bio Armor that evolves based upon your environment.  You are also able to siphon genetic data from your foes to empower yourself as well as shift from a Defensive, Offensive and Efficient form.  Bio Armor provides good damage resistance and defense, a fair amount of regeneration and a good number of offensive/debuff power options.","imageName":"BioArmor.png","displayName":"Bio Armor","powers":[{"allowedEnhancements":["Endurance_Discount","Recharge","Res_Damage"],"enhancementCount":6,"archetypeOrder":"secondary","powerIndex":0,"castTimeReal":0.67,"toggleCost":0.26,"fullName":"Brute_Secondary_Bio_Armor_Hardened_Carapace","displayName":"Hardened Carapace","requires":{"powers":{},"count":0},"accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"endCost":0.13,"rechargeTime":2,"baseRechargeTime":2,"activatePeriod":0.5,"effectArea":1,"numAllowed":1,"ignoreStrength":true,"description":{"short":"Self Toggle, +Res(Lethal, Smash, Toxic, Disorient, Sleep), +Special","long":"With a little concentration you can cause your skin to become hard as stone, boosting your constitution to reject toxins and recovering from wounds more quickly. While active, this power will boost your resistance to Lethal, Smashing and Toxic damage, grant a minor amount of regeneration, and protection from Disorient and Sleep effects. If Efficient Adaptation is active, Hardened Carapace will grant an Endurance Discount. If Defensive Adaptation is active, Hardened Carapace will grant additional resistance to Lethal, Smashing and Toxic damage. While Offensive Adaptation is active, this power will grant a minor boost to damage. Bonuses granted from Adaptations are unenhanceable. Recharge: Fast"},"setTypes":[8],"alwaysToggle":true,"level":1,"ignoreEnh":[],"ignore_Buff":[],"castTime":0.924,"slottable":true,"aoeModifier":1},{"allowedEnhancements":["Heal","Endurance_Modification"],"enhancementCount":6,"archetypeOrder":"secondary","powerIndex":1,"fullName":"Brute_Secondary_Bio_Armor_Inexhaustible","displayName":"Inexhaustible","requires":{"powers":{},"count":0},"accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"activatePeriod":5,"effectArea":1,"numAllowed":1,"description":{"short":"Auto: +Max HP, +Regen, +Recovery, +Res(Slow, End Drain), +Special","long":"Your body is constantly evolving and adapting based on your surroundings. As a result you receive a moderate bonus to maximum hit points, regeneration, recovery as well as gaining a measure of Slow and Endurance Drain Resistance. Half of this power's maximum hit point increase is unenhanceable.  While Efficient Adaptation is active, this power grants a small bonus to recovery and regeneration. While Defensive Adaptation is active you gain a small amount of additional maximum hit points. This power doesn't grant any bonuses to Offensive Adaptation. These special bonuses are unenhanceable. Inexhaustible is always active."},"setTypes":[9,22],"level":2,"ignoreEnh":[],"ignore_Buff":[],"castTime":0.132,"slottable":true,"aoeModifier":1},{"allowedEnhancements":["Defense_Buff","Endurance_Discount","Recharge"],"enhancementCount":6,"archetypeOrder":"secondary","powerIndex":2,"castTimeReal":0.73,"toggleCost":0.26,"fullName":"Brute_Secondary_Bio_Armor_Environmental_Modification","displayName":"Environmental Modification","requires":{"powers":{},"count":0},"accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"endCost":0.13,"rechargeTime":2,"baseRechargeTime":2,"activatePeriod":0.5,"effectArea":1,"numAllowed":1,"ignoreStrength":true,"description":{"short":"Self Toggle, +Res(Hold, Knockdown, Immobilize), +Def(Energy, Negative, Fire, Cold, Psionic), +Special","long":"Your body can spontaneously adapt to its surroundings and your mind has learned to shield itself from harmful effects by constant exposure to these dangers. While active you gain moderate defense to Fire, Cold, Energy and Negative Energy damage, and a small amount of defense to Psionic damage. Additionally you are protected against hold, knockdown and immobilize effects.  While Defensive Adaptation is active you gain a minor amount of Lethal, Smashing, Fire, Cold, Energy, Negative Energy and Psionic defense, as well as a minor amount of maximum hit points. If Offensive Adaptation is active you'll gain a moderate To Hit bonus. These special bonuses are unenhanceable. Recharge: Fast"},"setTypes":[7],"alwaysToggle":true,"level":4,"variableMax":3,"ignoreEnh":[],"ignore_Buff":[],"castTime":0.924,"slottable":true,"aoeModifier":1},{"allowedEnhancements":[],"enhancementCount":0,"archetypeOrder":"secondary","subPowers":[{"allowedEnhancements":[],"enhancementCount":0,"archetypeOrder":"secondary","powerIndex":0,"parent":"Brute_Secondary_Bio_Armor_Adaptation","castTimeReal":1,"fullName":"Brute_Secondary_Bio_Armor_Defensive_Adaptation","displayName":"Defensive Adaptation","accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"rechargeTime":4,"baseRechargeTime":4,"activatePeriod":1,"effectArea":1,"numAllowed":1,"description":{"short":"Toggle: Bio Armor Defensive Mode","long":"By activating this power you cause your Bio Armor to spontaneously mutate, causing it to become dense and durable. While active Hardened Carapace grants additional resistance to Lethal, Smashing and Toxic damage, Inexhaustible grants additional Maximum HP, Environmental Modification grants additional defense and also grants a small amount of Maximum HP, Evolving Armor grants additional resistance and a small amount of defense per nearby target but loses the resistance debuff effect, Ablative Carapace grants additional damage absorption, DNA Siphon grants additional health per target hit and Parasitic Aura grants additional damage absorption per target hit.  Additionally, many of your damaging attacks will heal you for a minor amount of health.  However, the bulkiness of this adaptation reduces your damage moderately.  Defensive Adaptation costs no endurance."},"setTypes":[],"ignoreEnh":[],"ignore_Buff":[],"includeFlag":true,"castTime":1.188,"aoeModifier":1,"displayLocation":31},{"allowedEnhancements":[],"enhancementCount":0,"archetypeOrder":"secondary","powerIndex":1,"parent":"Brute_Secondary_Bio_Armor_Adaptation","castTimeReal":0.67,"fullName":"Brute_Secondary_Bio_Armor_Efficient_Adaptation","displayName":"Efficient Adaptation","accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"rechargeTime":4,"baseRechargeTime":4,"activatePeriod":1,"effectArea":1,"numAllowed":1,"description":{"short":"Toggle: Bio Armor Efficient Mode","long":"By activating this power you cause your Bio Armor to spontaneously mutate, causing it to become evenly distributed along your body. While active Hardened Carapace grants a minor Endurance Discount, Inexhaustible grants additional regeneration and recovery, Ablative Carapace grants a bonus to regeneration, Evolving Armor grants additional regeneration and recovery for nearby targets, and both DNA Siphon and Parasitic Aura grant increased regeneration and recovery.  Efficient Adaptation costs no endurance."},"setTypes":[],"ignoreEnh":[],"ignore_Buff":[],"includeFlag":true,"castTime":0.924,"aoeModifier":1,"displayLocation":37},{"allowedEnhancements":[],"enhancementCount":0,"archetypeOrder":"secondary","powerIndex":2,"parent":"Brute_Secondary_Bio_Armor_Adaptation","castTimeReal":0.67,"fullName":"Brute_Secondary_Bio_Armor_Offensive_Adaptation","displayName":"Offensive Adaptation","accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"rechargeTime":4,"baseRechargeTime":4,"activatePeriod":1,"effectArea":1,"numAllowed":1,"description":{"short":"Toggle: Bio Armor Offensive Mode","long":"By activating this power you cause your Bio Armor to spontaneously mutate, causing it to sprout spines and become much lighter. While active Hardened Carapace increases your damage slightly, Environmental Modification grants you a moderate to hit buff, Evolving Armor has an improved Damage Resistance debuff, and debuff effects from DNA Siphon, Genetic Contamination and Parasitic Aura are increased moderately.  Additionally, many of your damaging powers will inflict a minor amount of additional Toxic damage.  While Offensive Adaptation is active your Defense and Damage Resistance is reduced slightly.  Offensive Adaptation costs no endurance."},"setTypes":[],"ignoreEnh":[],"ignore_Buff":[],"includeFlag":true,"castTime":0.924,"aoeModifier":1,"displayLocation":43}],"powerIndex":3,"fullName":"Brute_Secondary_Bio_Armor_Adaptation","displayName":"Adaptation","requires":{"powers":{},"count":0},"accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"activatePeriod":99999,"effectArea":1,"numAllowed":1,"description":{"short":"Gain Efficient, Defensive and Offensive Adaptations","long":"By purchasing this power you gain access to three mutually exclusive toggle powers: Efficient Adaptation, Defensive Adaptation and Offensive Adaptation. If Defensive Adaptation is active you gain improved damage resistance from Hardened Carapace and Evolving Armor, additional defense from Environmental Modification and Evolving Armor, and increased Maximum HP from Environmental Modification and Inexhaustible. If Offensive Adaptation is active you gain bonus damage from Hardened Carapace, additional To Hit from Environmental Modification, empowered -resistance debuff from Evolving Armor, and your debuff effects from DNA Siphon, Genetic Contamination and Parasitic Aura are increased.  While Efficient Adaptation is active Hardened Carapace will provide a moderate endurance discount, Inexhaustible has increased Regeneration and Recovery, Evolving Armor grants additional regeneration and recovery per nearby target, DNA Siphon grants additional regeneration and recovery for each defeated target and Parasitic Aura grants additional regeneration and recovery for each nearby target."},"setTypes":[],"level":10,"ignoreEnh":[],"ignore_Buff":[],"castTime":0.132,"aoeModifier":1},{"allowedEnhancements":["Endurance_Discount","Heal","Recharge"],"enhancementCount":6,"archetypeOrder":"secondary","powerIndex":4,"castTimeReal":2.03,"toggleCost":10.4,"fullName":"Brute_Secondary_Bio_Armor_Ablative_Carapace","displayName":"Ablative Carapace","requires":{"powers":{},"count":0},"accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"endCost":10.4,"rechargeTime":90,"baseRechargeTime":90,"effectArea":1,"numAllowed":1,"description":{"short":"Self, +Absorption, +Regeneration","long":"When needed, you're able to cause your Bio Armor to gain a thick, but brittle outer layer that will absorb a large amount of damage before breaking off. Ablative Carapace will grant a moderate amount of damage absorption and a high amount of regeneration for a short time.  While Efficient Adaptation is active, this power grants a slightly larger regeneration buff.  While Defensive Adaptation is active, this power grants a bonus to damage absorption.  Recharge: Long"},"setTypes":[9],"clickBuff":true,"level":16,"ignoreEnh":[],"ignore_Buff":[],"castTime":2.244,"slottable":true,"aoeModifier":1},{"allowedEnhancements":["Endurance_Discount","Recharge","Res_Damage","Taunt"],"enhancementCount":6,"archetypeOrder":"secondary","powerIndex":5,"castTimeReal":2.93,"toggleCost":0.26,"fullName":"Brute_Secondary_Bio_Armor_Evolving_Armor","displayName":"Evolving Armor","requires":{"powers":{},"count":0},"accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"endCost":0.13,"rechargeTime":10,"baseRechargeTime":10,"activatePeriod":0.5,"effectArea":2,"radius":8,"maxTargets":10,"numAllowed":1,"ignoreStrength":true,"description":{"short":"Self Toggle, +Res(All), Foe -Res(All), Taunt, +Special","long":"When faced with danger, your Bio Armor reacts by becoming incredibly durable as well as infecting nearby enemies, lowering their resistance to damage. While active, Evolving Armor will grant you small amount of damage resistance, plus an additional amount for each nearby target. Nearby foes will also be taunted and have their damage resistance reduced. While Efficient Adaptation is active, this power grants a moderate bonus to Regeneration and Recovery plus a tiny amount of both for each nearby foe up to 10 foes. While Defensive Adaptation is active you gain a very minor amount of defense and damage resistance for each nearby foe, however you lose the benefit of this power's resistance debuff. If Offensive Adaptation is active this power's damage resistance debuff is increased. These special bonuses are unenhanceable. Recharge: Slow"},"setTypes":[8],"level":20,"variableEnabled":true,"variableMax":10,"ignoreEnh":[],"ignore_Buff":[],"castTime":3.168,"slottable":true,"aoeModifier":2.2},{"allowedEnhancements":["Accuracy","Damage","Endurance_Discount","Heal","Recharge","Endurance_Modification","Taunt"],"enhancementCount":6,"archetypeOrder":"secondary","powerIndex":6,"castTimeReal":1.67,"toggleCost":13,"fullName":"Brute_Secondary_Bio_Armor_DNA_Siphon","displayName":"DNA Siphon","requires":{"powers":{},"count":0},"accuracy":1,"accuracyMult":1,"attackTypes":20,"target":1,"targetLoS":true,"endCost":13,"rechargeTime":90,"baseRechargeTime":90,"effectArea":2,"radius":20,"maxTargets":10,"numAllowed":1,"description":{"short":"Click, PBAoE Minor DMG(Lethal/Toxic) Foe -Regen, Taunt, Self +HP, +End, +Special","long":"You can siphon genetic material from nearby enemies, causing a minor amount of Lethal damage and a minor amount of Toxic damage over time. Living enemies will provide the user with a small boost to health and endurance. These foes will have their regeneration rate reduced for a short period of time. Defeated enemies provide a weaker sample of material and thus will boost recovery and regeneration for a short while. While Efficient Adaptation is active, this power will grant bonus regeneration and recovery per defeated target hit.  While Defensive Adaptation is active, this power will grant bonus health per living target hit.  While Offensive Adaptation is active this power's regeneration debuff is increased in effectiveness. Damage: Minor, Recharge: Very Long"},"setTypes":[4,9,22,24,29,34,44],"level":28,"variableEnabled":true,"variableMax":10,"ignoreEnh":[13],"ignore_Buff":[],"castTime":1.848,"slottable":true,"aoeModifier":4},{"allowedEnhancements":["Accuracy","Damage","Endurance_Discount","Recharge","Taunt"],"enhancementCount":6,"archetypeOrder":"secondary","powerIndex":7,"castTimeReal":1.07,"toggleCost":0.52,"fullName":"Brute_Secondary_Bio_Armor_Genetic_Contamination","displayName":"Genetic Contamination","requires":{"powers":{},"count":0},"accuracy":1,"accuracyMult":1,"attackTypes":1,"target":1,"targetLoS":true,"endCost":1.04,"rechargeTime":4,"baseRechargeTime":4,"activatePeriod":2,"effectArea":2,"radius":8,"maxTargets":10,"numAllowed":1,"description":{"short":"Toggle: PBAoE, Minor DoT(Toxic), -Damage(All)","long":"You're capable of breaking down the genetic material of your foes with a powerful toxin that is produced by your Bio Armor. Nearby foes affected by this poison will suffer toxic damage over time as well as dealing reduced damage. While Defensive Adaptation is active this power's damage debuff is increased in effectiveness. Damage: Minor Recharge: Fast"},"setTypes":[4,34,44],"level":35,"ignoreEnh":[],"ignore_Buff":[],"castTime":1.31999993,"slottable":true,"aoeModifier":2.2},{"allowedEnhancements":["Accuracy","Heal","Recharge","Endurance_Modification","Taunt"],"enhancementCount":6,"archetypeOrder":"secondary","powerIndex":8,"castTimeReal":1.87,"toggleCost":18.2,"fullName":"Brute_Secondary_Bio_Armor_Parasitic_Aura","displayName":"Parasitic Aura","requires":{"powers":{},"count":0},"accuracy":1.5,"accuracyMult":1.5,"attackTypes":20,"target":1,"targetLoS":true,"endCost":18.2,"rechargeTime":270,"baseRechargeTime":270,"effectArea":2,"radius":15,"maxTargets":10,"numAllowed":1,"ignoreStrength":true,"description":{"short":"PBAoE, Self +Absorb, +Regeneration, +Recovery, Foe -DMG","long":"You release a cloud of parasites around you that draw out your enemies' genetic material. These parasites dramatically increase your survivability by gaining damage absorption while boosting your regeneration and recovery rate for a short time. Affected foes will be infected and deal reduced damage for a short while.  While Efficient Adaptation is active, this power will grant additional regeneration and recovery per target hit.  While Defensive Adaptation is active, this power will grant a small amount of additional damage absorption and increase the effectiveness of this power's damage debuff. Recharge: Very Long"},"setTypes":[9,22,24,29],"clickBuff":true,"level":38,"variableEnabled":true,"variableMax":10,"ignoreEnh":[],"ignore_Buff":[],"castTime":2.112,"slottable":true,"aoeModifier":3.25}]}