{"description":"Your body is shielded by an incredibly durable Bio Armor that evolves based upon your environment.  You are also able to siphon genetic data from your foes to empower yourself as well as shift from a Defensive, Offensive and Efficient form.  Bio Armor provides good damage resistance and defense, a fair amount of regeneration and a good number of offensive/debuff power options.","imageName":"BioArmor.png","displayName":"Bio Armor","powers":[{"castTimeReal":1,"isEpic":true,"locationIndex":31,"displayName":"Defensive Adaptation","accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"rechargeTime":4,"baseRechargeTime":4,"activatePeriod":1,"effectArea":1,"maxBoosts":"0","numAllowed":1,"boostsAllowed":[],"enhancements":[],"description":{"short":"Toggle: Bio Armor Defensive Mode","long":"By activating this power you cause your Bio Armor to spontaneously mutate, causing it to become dense and durable. While active Hardened Carapace grants additional resistance to Lethal, Smashing and Toxic damage, Boundless Energy grants additional Maximum HP, Environmental Modification grants additional defense and also grants a small amount of Maximum HP, Ablative Carapace grants additional damage absorption, DNA Siphon grants additional health per target hit and Parasitic Aura grants additional damage absorption per target hit.  Genetic Corruption will also grant a small amount of additional damage resistance and increase the potency of the power's damage debuff.  Additionally, many of your damaging attacks will heal you for a minor amount of health.  However, the bulkiness of this adaptation reduces your damage moderately.  Defensive Adaptation costs no endurance."},"setTypes":[],"ignoreEnh":[],"ignore_Buff":[],"includeFlag":true,"castTime":1.188,"aoeModifier":1,"displayLocation":31},{"castTimeReal":0.67,"isEpic":true,"locationIndex":37,"displayName":"Efficient Adaptation","accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"rechargeTime":4,"baseRechargeTime":4,"activatePeriod":1,"effectArea":1,"maxBoosts":"0","numAllowed":1,"boostsAllowed":[],"enhancements":[],"description":{"short":"Toggle: Bio Armor Efficient Mode","long":"By activating this power you cause your Bio Armor to spontaneously mutate, causing it to become evenly distributed along your body. While active Hardened Carapace grants a minor Endurance Discount, Boundless Energy grants additional regeneration and recovery, Ablative Carapace grants a bonus to regeneration and both DNA Siphon and Parasitic Aura grant increased regeneration and recovery and Genetic Corruption grants a minor regeneration buff.  Efficient Adaptation costs no endurance."},"setTypes":[],"ignoreEnh":[],"ignore_Buff":[],"includeFlag":true,"castTime":0.924,"aoeModifier":1,"displayLocation":37},{"castTimeReal":0.67,"isEpic":true,"locationIndex":43,"displayName":"Offensive Adaptation","accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"rechargeTime":4,"baseRechargeTime":4,"activatePeriod":1,"effectArea":1,"maxBoosts":"0","numAllowed":1,"boostsAllowed":[],"enhancements":[],"description":{"short":"Toggle: Bio Armor Offensive Mode","long":"By activating this power you cause your Bio Armor to spontaneously mutate, causing it to sprout spines and become much lighter. While active Hardened Carapace increases your damage slightly, Environmental Modification grants you a moderate to hit buff, and debuff effects from DNA Siphon and Parasitic Aura are increased moderately.  Genetic Corruption will have its chance to put enemies to sleep increased.  Additionally, many of your damaging powers will inflict a minor amount of additional Toxic damage.  While Offensive Adaptation is active your Defense and Damage Resistance is reduced slightly.  Offensive Adaptation costs no endurance."},"setTypes":[],"ignoreEnh":[],"ignore_Buff":[],"includeFlag":true,"castTime":0.924,"aoeModifier":1,"displayLocation":43},{"castTimeReal":0.67,"toggleCost":0.26,"displayName":"Hardened Carapace","accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"endCost":0.13,"rechargeTime":2,"baseRechargeTime":2,"activatePeriod":0.5,"effectArea":1,"maxBoosts":"6","numAllowed":1,"boostsAllowed":["EnduranceDiscount_Boost","Recharge_Boost","Res_Damage_Boost"],"enhancements":[8,18,19],"ignoreStrength":true,"description":{"short":"Self Toggle, +Res(Lethal, Smash, Toxic, Disorient, Sleep), +Special","long":"With a little concentration you can cause your skin to become hard as stone, boosting your constitution to reject toxins and recovering from wounds more quickly. While active, this power will boost your resistance to Lethal, Smashing and Toxic damage, grant a minor amount of regeneration, and protection from Disorient and Sleep effects. If Efficient Adaptation is active, Hardened Carapace will grant an Endurance Discount. If Defensive Adaptation is active, Hardened Carapace will grant additional resistance to Lethal, Smashing and Toxic damage. While Offensive Adaptation is active, this power will grant a minor boost to damage. Bonuses granted from Adaptations are unenhanceable. Recharge: Fast"},"setTypes":[8],"alwaysToggle":true,"level":1,"ignoreEnh":[],"ignore_Buff":[],"castTime":0.924,"slottable":true,"aoeModifier":1},{"displayName":"Inexhaustible","accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"activatePeriod":5,"effectArea":1,"maxBoosts":"6","numAllowed":1,"boostsAllowed":["Heal_Boost","Recovery_Boost"],"enhancements":[11,7],"description":{"short":"Auto: +Max HP, +Regen, +Recovery, +Res(Slow, End Drain), +Special","long":"Your body constantly evolves and addresses weaknesses. As a result you receive a moderate bonus to maximum hit points, regeneration, recovery as well as gaining a measure of Slow and Endurance Drain Resistance. Half of this power's maximum hit point increase is unenhanceable.  While Efficient Adaptation is active, this power grants a small bonus to recovery and regeneration. While Defensive Adaptation is active you gain a small amount of additional maximum hit points. This power doesn't grant any bonuses to Offensive Adaptation. These special bonuses are unenhanceable.  Boundless Energy is always active."},"setTypes":[9,22],"level":2,"ignoreEnh":[],"ignore_Buff":[],"castTime":0.132,"slottable":true,"aoeModifier":1},{"castTimeReal":0.73,"toggleCost":0.26,"displayName":"Environmental Adaptation","accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"endCost":0.13,"rechargeTime":2,"baseRechargeTime":2,"activatePeriod":0.5,"effectArea":1,"maxBoosts":"6","numAllowed":1,"boostsAllowed":["Buff_Defense_Boost","EnduranceDiscount_Boost","Recharge_Boost"],"enhancements":[5,8,18],"ignoreStrength":true,"description":{"short":"Self Toggle, +Res(Hold, Knockdown, Immobilize), +Def(Energy, Negative, Fire, Cold, Psionic), +Special","long":"Your body can spontaneously adapt to its surroundings and your mind has learned to shield itself from harmful effects by constant exposure to these dangers. While active you gain moderate defense to Fire, Cold, Energy and Negative Energy damage, and a small amount of defense to Psionic damage. Additionally you are protected against hold, knockdown and immobilize effects.  While Defensive Adaptation is active you gain a minor amount of Lethal, Smashing, Fire, Cold, Energy, Negative Energy and Psionic defense, as well as a minor amount of maximum hit points. If Offensive Adaptation is active you'll gain a moderate To Hit bonus. These special bonuses are unenhanceable. Recharge: Fast"},"setTypes":[7],"alwaysToggle":true,"level":4,"ignoreEnh":[],"ignore_Buff":[],"castTime":0.924,"slottable":true,"aoeModifier":1},{"displayName":"Adaptation","accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"activatePeriod":99999,"effectArea":1,"maxBoosts":"0","numAllowed":1,"boostsAllowed":[],"enhancements":[],"description":{"short":"Gain Efficient, Defensive and Offensive Adaptations","long":"By purchasing this power you gain access to three mutually exclusive toggle powers: Efficient Adaptation, Defensive Adaptation and Offensive Adaptation. If Defensive Adaptation is active you gain improved damage resistance from Hardened Carapace and Genetic Corruption, additional defense from Environmental Modification, and increased Maximum HP from Environmental Modification and Boundless Energy. If Offensive Adaptation is active you gain bonus damage from Hardened Carapace, additional To Hit from Environmental Modification, empowered debuff effects from DNA Siphon, and Parasitic Aura and increased sleep chance from Genetic Corruption.    While Efficient Adaptation is active Hardened Carapace will provide a moderate endurance discount, Boundless Energy has increased Regeneration and Recovery, Genetic Corruption grants additional regeneration, DNA Siphon grants additional regeneration and recovery for each defeated target and Parasitic Aura grants additional regeneration and recovery for each nearby target."},"setTypes":[],"level":10,"ignoreEnh":[],"ignore_Buff":[],"castTime":0.132,"aoeModifier":1},{"castTimeReal":2.03,"toggleCost":10.4,"displayName":"Ablative Carapace","accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"endCost":10.4,"rechargeTime":90,"baseRechargeTime":90,"effectArea":1,"maxBoosts":"6","numAllowed":1,"boostsAllowed":["EnduranceDiscount_Boost","Heal_Boost","Recharge_Boost"],"enhancements":[8,11,18],"description":{"short":"Self, +Absorption, +Regeneration","long":"When needed, you're able to cause your Bio Armor to gain a thick, but brittle outer layer that will absorb a large amount of damage before breaking off. Ablative Carapace will grant a moderate amount of damage absorption and a high amount of regeneration for a short time.  While Efficient Adaptation is active, this power grants a slightly larger regeneration buff.  While Defensive Adaptation is active, this power grants a bonus to damage absorption.  Recharge: Long"},"setTypes":[9],"clickBuff":true,"level":16,"ignoreEnh":[],"ignore_Buff":[],"castTime":2.244,"slottable":true,"aoeModifier":1},{"castTimeReal":0.73,"toggleCost":13,"displayName":"Rebuild DNA","accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"endCost":13,"rechargeTime":90,"baseRechargeTime":90,"effectArea":1,"maxBoosts":"6","numAllowed":1,"boostsAllowed":["EnduranceDiscount_Boost","Heal_Boost","Recharge_Boost","Recovery_Boost"],"enhancements":[8,11,18,7],"description":{"short":"Self +HP, +End, +Special","long":"You rebuild your genetic makeup to restore some of your health and endurance. While Efficient Adaptation is active, this power will grant bonus endurance. While Defensive Adaptation is active, this power will grant bonus health.  While Offensive Adaptation is active, this power's will increase your perception. Recharge: Very Long"},"setTypes":[9,22],"level":20,"ignoreEnh":[],"ignore_Buff":[],"castTime":0.924,"slottable":true,"aoeModifier":1},{"displayName":"Athletic Regulation","accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"activatePeriod":2,"effectArea":1,"maxBoosts":"6","numAllowed":1,"boostsAllowed":["SpeedFlying_Boost","SpeedRunning_Boost"],"enhancements":[10,20],"description":{"short":"Auto: Self +SPD, +Special","long":"Your body is continually regulating your athletic capabilities to best fit your current need. While Offensive Adaptation is active you gain a strong increase in strength to all your run and flight powers. While Defensive Adaptation is active you gain very strong movement debuff resistance in addition to a bonus to defense debuff resistance. While Efficient Adaptation is active, you gain a good balance of both, resistance and movement speed strength. This power is always on and permanently increases your movement speed, regardless your Adaptation. You also gain a small amount of defense debuff resistance."},"setTypes":[17,19],"clickBuff":true,"level":28,"ignoreEnh":[],"ignore_Buff":[],"castTime":0.132,"slottable":true,"aoeModifier":1},{"displayName":"Genomic Evolution","accuracy":1,"accuracyMult":1,"target":1,"targetLoS":true,"activatePeriod":5,"effectArea":1,"maxBoosts":"6","numAllowed":1,"boostsAllowed":["Res_Damage_Boost"],"enhancements":[19],"description":{"short":"Auto: +Res(All), +Special","long":"Your body has evolved to protect you from all damage types. As a result you receive a moderate bonus to damage resistance against all types. While Efficient Adaptation is active you gain a power bonus to your max endurance. While Defensive Adaptation is active you gain a bonus to damage resistance. While Offensive Adaptation is active you gain increased range buff. These special bonuses are unenhanceable.  This power is always active and cost no endurance."},"setTypes":[8],"alwaysToggle":true,"level":35,"ignoreEnh":[],"ignore_Buff":[],"castTime":0.132,"slottable":true,"aoeModifier":1},{"castTimeReal":1.87,"toggleCost":18.2,"displayName":"Parasitic Leech","accuracy":1.5,"accuracyMult":1.5,"attackTypes":20,"target":2048,"targetLoS":true,"range":40,"endCost":18.2,"rechargeTime":270,"baseRechargeTime":270,"effectArea":3,"radius":90,"arc":90,"maxTargets":5,"maxBoosts":"6","numAllowed":1,"boostsAllowed":["Accuracy_Boost","Heal_Boost","Recharge_Boost","Recovery_Boost"],"enhancements":[1,11,18,7],"ignoreStrength":true,"description":{"short":"PBAoE, Self +Absorb, +Regeneration, +Recovery, Foe -DMG","long":"You release a wave of parasites around you that draw out your enemies' genetic material. These parasites dramatically increase your survivability by gaining damage absorption while boosting your regeneration and recovery rate for a short time. Affected foes will be infected and deal reduced regeneration for a short while.  While Offensive Adaptation is active, this power will apply a stronger regeneration debuff. While Efficient Adaptation is active, this power will grant additional regeneration and recovery per target hit.  While Defensive Adaptation is active, this power will grant a small amount of additional damage absorption and increase the effectiveness of this power's damage debuff. Recharge: Very Longfor a short while.  While Efficient Adaptation is active, this power will grant additional regeneration and recovery per target hit.  While Defensive Adaptation is active, this power will grant a small amount of additional damage absorption and increase the effectiveness of this power's damage debuff. Recharge: Very Long"},"setTypes":[9,22,29],"clickBuff":true,"level":38,"variableEnabled":true,"variableMax":5,"ignoreEnh":[],"ignore_Buff":[],"castTime":2.112,"slottable":true,"aoeModifier":5.58991957}]}